{"id":2132,"date":"2018-02-23T04:53:00","date_gmt":"2018-02-23T04:53:00","guid":{"rendered":"https:\/\/maxcoach.thememove.com\/main\/?p=2132"},"modified":"2020-05-15T08:49:29","modified_gmt":"2020-05-15T08:49:29","slug":"food-label-claims-separating-fact-from-fiction-2","status":"publish","type":"post","link":"https:\/\/maxcoach.thememove.com\/main\/food-label-claims-separating-fact-from-fiction-2\/","title":{"rendered":"Why Do I Need a Health Coach?"},"content":{"rendered":"\n<p>Humans naturally resist change, even when a change might result in a positive outcome. It’s understandable. There’s a certain comfort and familiarity we experience when going through the habitual motions of day-to-day life.<\/p>\n\n\n\n<p>There are numerous examples of how individuals continuously engage in daily lifestyle behaviors without conscious thought because they’ve become habits. Driving to work using the same route without remembering the drive. Brushing your teeth without thinking because it’s just something you do. Or reaching for a quick snack out of convenience and a need for fuel without really contemplating the quality of that food. These are habits. Everyone has them. We naturally resist change because it’s challenging, but we’re capable of adapting to new behaviors when guided effectively. &nbsp;<\/p>\n\n\n\n<p>A health coach is somebody who can guide your behavior change. Here’s why and how a health coach can be a necessary and integral part of your healthy lifestyle team.<\/p>\n\n\n\n<h2><strong>Health Coaches Use a Holistic Lens<\/strong><\/h2>\n\n\n\n<p>Health coaches are trained in the psychology of behavior change as well as nutrition and physical activity. To encourage and elicit change for their clients, health coaches apply a multipronged approach that allows clients to dive deep into the root causes of current behaviors and the barriers associated with developing new behaviors. Health coaches don’t just focus on helping their clients become physically fit; they focus on all aspects of wellness.<\/p>\n\n\n\n<h2><strong>Health Coaches Focus on Goal-driven Change<\/strong><\/h2>\n\n\n\n<p>Health coaches also assist their clients in developing SMART (specific, measurable, attainable, relevant and time-bound) goals. Clients generally come to health coaches and exercise professionals with a loosely defined, outcome-based goal (usually weight-centered) in mind. For example, “I want to lose weight” or “I want to tone up.” These goals aren’t specific, and they focus on the&nbsp;<em>outcome<\/em>&nbsp;versus a behavior-oriented&nbsp;<em>process<\/em>.<\/p>\n\n\n\n<p>SMART goals help clients clarify their intentions and identify barriers that prevent them from making sustainable lifestyle changes. Health coaches also assist their clients in developing strategies to manage the change process (how to practice portion control or plan for high-risk situations, for example). In short, a health coach is trained to guide you in developing a self-directed, personally meaningful and customized action plan.&nbsp;<\/p>\n\n\n\n<h2><strong>Health Coaches Help Clients Enhance Self-reliance<\/strong><\/h2>\n\n\n\n<p>Through their partnership with their clients, health coaches encourage the development of positive self-talk and self-reliance—both of which support long-term lifestyle change. Through cognitive coaching, clients also learn to alter their inner voices and ditch the negative self-talk and beliefs associated with making a change. This results in improved self-confidence and enhanced self-efficacy. The higher the self-efficacy, the more likely positive changes will occur and last.<\/p>\n\n\n\n<h2><strong>Health Coaches Offer Nonjudgmental Support<\/strong><\/h2>\n\n\n\n<p>A health coach has a vested interest in the health and well-being of their clients. Health coaches’ interests lie in helping their clients see the bigger change and purpose for change (lowering disease risk, improving energy, increasing longevity, etc.). To do this effectively, health coaches put the power of change in the hands of their clients and inspire them to become the expert in their own lives. Health coaches do this by offering nonjudgmental support and constant encouragement.<\/p>\n\n\n\n<h2>Health Coaches Support Improved Life Balance<\/h2>\n\n\n\n<p>Health and wellness are so much more than physical activity and nutrition. It’s about nurturing a balance between the physical, emotional, social, occupational, intellectual and spiritual aspects of life. Because health coaches are trained to use a multifaceted approach to ignite change, clients are able to find and maintain a reasonable balance in their day-to-day lives. They learn to prioritize their needs in order to live healthier lives, whether that’s by improving sleep, reducing stress, practicing self-care, cultivating relationships or balancing nutrition and activity. Health coaches are the key to unlocking that potential for their clients. &nbsp;<\/p>\n\n\n\n<p>Health coaches are unique members of the allied healthcare continuum. They apply their knowledge and skills in a way that motivates change rather than directs change. Health coaches actively partner with their clients and use skillful motivational conversation to help clients identify, develop and implement self-directed methods of change.<\/p>\n\n\n\n<p>Behavior change is anything but a simple and straightforward process, and it can be frustrating and bewildering at times. When it comes to changing behaviors, certified health coaches are central to helping their clients develop sustainable change and continue to manage those changes effectively so that they become a natural part of day-to-day life.<\/p>\n\n\n\n<p>Why do you need a health coach? Because health coaches work to mentor, inspire and motivate. These efforts, along with the active partnership coaches create with their clients, ultimately lead to a more permanent state of change because clients have practiced and nurtured a specific set of skills and tools to support that change.&nbsp;<\/p>\n\n\n\n<p>Source: acefitness.org<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A health coach is somebody who can guide your behavior change. Here’s why and how a health coach can be a necessary and integral part of your healthy lifestyle team.<\/p>\n","protected":false},"author":1,"featured_media":2048,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"pmpro_default_level":0},"categories":[72],"tags":[75],"_links":{"self":[{"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/posts\/2132"}],"collection":[{"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/comments?post=2132"}],"version-history":[{"count":2,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/posts\/2132\/revisions"}],"predecessor-version":[{"id":2474,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/posts\/2132\/revisions\/2474"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/media\/2048"}],"wp:attachment":[{"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/media?parent=2132"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/categories?post=2132"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/maxcoach.thememove.com\/main\/wp-json\/wp\/v2\/tags?post=2132"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}